SPedt_!/src/Documents/Расходная/Расходная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Расходная</name>
  <registerRecords>InformationRegister.ОбменССайтом</registerRecords>
  <registerRecords>AccumulationRegister.Расход</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.Обмен100СПрн</registerRecords>
  <registerRecords>AccumulationRegister.Обмен100СПрн_Ошибки</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <registerRecords>InformationRegister.Обмен100сп</registerRecords>
  <registerRecords>AccumulationRegister.Транзит</registerRecords>
  <registerRecords>InformationRegister.Обмен100спСообщения</registerRecords>
  <registerRecords>AccumulationRegister.КПолучению</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.Возвраты</registerRecords>
  <attributes>
    <name>Участник</name>
    <type>
      <types>CatalogRef.Участники</types>
    </type>
  </attributes>
  <attributes>
    <name>Списать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Напечатано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоискНикаСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автозаполнение</name>
    <type>
      <types>CatalogRef.ГруппыУчастников</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьИтого</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредоплатаОрганизатор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредоплатаУчастник</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьСкидки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусВыдачи</name>
    <type>
      <types>EnumRef.СтатусыВыдачиПокупок</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоискЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КартаУчастника</name>
    <type>
      <types>CatalogRef.КартыУчастников</types>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОплаты</name>
    <type>
      <types>EnumRef.ФормыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЧекаККМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСменыККМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусККМ</name>
    <type>
      <types>EnumRef.СтатусыЧековККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>Архивный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаВыполнена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылочныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерКарты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПробитЧекОтмены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПомеченныхСтрок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Покупки</name>
    <attributes>
      <name>Потерян</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Покупка</name>
      <type>
        <types>CatalogRef.Покупки</types>
        <types>CatalogRef.Заказы</types>
        <types>CatalogRef.Посылки</types>
        <types>CatalogRef.Пристрой</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПокупкаСпр</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Оплачен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоХранения</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>Габарит</name>
      <type>
        <types>CatalogRef.Габариты</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяХранения</name>
      <comment>в днях</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>DocumentRef.Движение</types>
        <types>DocumentRef.КорректировкаЗаписейРегистров</types>
        <types>DocumentRef.Приходная</types>
        <types>DocumentRef.ПоступлениеПристроя</types>
        <types>DocumentRef.РазборКоробки</types>
      </type>
    </attributes>
    <attributes>
      <name>Оплатить</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КодЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШК</name>
      <type>
        <types>CatalogRef.Мегаордера</types>
      </type>
    </attributes>
    <attributes>
      <name>ПерваяТочка</name>
      <type>
        <types>CatalogRef.ТочкиРаздачи</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПраздничныхДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьХранения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьДоставки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьИтого</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОплачиваетОрганизатор</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОплачиваетУчастник</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БесплатнаяВыдача</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОплаченоУчастником</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Надбавка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подбор</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.КартыУчастников</types>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SPedt_!/src/CommonModules/спПочтовыеСообщения/Module.bsl
Функция ПараметыЧекаТранзита(ВыдачаТранзита) Экспорт
	
	
	
	ПолучателиПисьма				= Новый Массив;
	
	новыйПолучатель 				= Новый Структура("Адрес, Представление, ИсточникКонтактнойИнформации");
	новыйПолучатель.Адрес 			= ВыдачаТранзита.ТочкаНазначения.Майл;;
	новыйПолучатель.Представление 	= ВыдачаТранзита.ТочкаНазначения.Наименование;
	новыйПолучатель.ИсточникКонтактнойИнформации = ВыдачаТранзита.ТочкаНазначения;
	ПолучателиПисьма.Добавить(новыйПолучатель);
	
	
	доки = новый массив;
	доки.Добавить(ВыдачаТранзита);
	табДокЧекка = Документы.ВыдачаТранзита.Печать_ЧекСИтогамиПоГабаритам(доки,Неопределено);
	
	имяФайлаВложения = ПолучитьИмяВременногоФайла("xls");
	табДокЧекка.Записать(имяФайлаВложения,ТипФайлаТабличногоДокумента.XLS);
	АдресВоВременномХранилище =ПоместитьВоВременноеХранилище(новый ДвоичныеДанные(имяФайлаВложения));;
	
	ТемаПисьма =ВыдачаТранзита.ТочкаОтправитель.Наименование+ " Транзит №"+ ВыдачаТранзита.Номер+" от "+Формат(ВыдачаТранзита.дата,"ДФ=dd.MM.yyyy");
	
	
	чек = Новый Структура;
	чек.Вставить("Представление", "Транзит №"+ ВыдачаТранзита.Номер+" от "+Формат(ВыдачаТранзита.дата,"ДФ=dd.MM.yyyy")+"_" +ВыдачаТранзита.ТочкаОтправитель+".xls");
	чек.Вставить("АдресВоВременномХранилище", АдресВоВременномХранилище);
	
	Вложения = Новый Массив;
	Вложения.Добавить(чек);
	
	ПарамтерыОтправления = Новый Структура;
	ПарамтерыОтправления.Вставить("Кому", 		ПолучателиПисьма);
	ПарамтерыОтправления.Вставить("Получатель", ПолучателиПисьма);
	ПарамтерыОтправления.Вставить("Предмет", 	ВыдачаТранзита);
	ПарамтерыОтправления.Вставить("Тема", 		ТемаПисьма);
	ПарамтерыОтправления.Вставить("Тело", 		ТемаПисьма);
	ПарамтерыОтправления.Вставить("Вложения",	Вложения);
	
	Возврат ПарамтерыОтправления;
	
КонецФункции

Функция ПараметыЧекаРасходной(Расходная) Экспорт
	
	
	
	ПолучателиПисьма				= Новый Массив;
	
	новыйПолучатель 				= Новый Структура("Адрес, Представление, ИсточникКонтактнойИнформации");
	новыйПолучатель.Адрес 			= Расходная.Ответственный.ЕМайл;;
	новыйПолучатель.Представление 	= Расходная.Ответственный.Наименование;
	новыйПолучатель.ИсточникКонтактнойИнформации = Расходная.Ответственный;
	ПолучателиПисьма.Добавить(новыйПолучатель);
	
	
	доки = новый массив;
	доки.Добавить(Расходная);
	табДокЧекка = Документы.Расходная.СписокЗаказов(доки,Неопределено);
	
	имяФайлаВложения = ПолучитьИмяВременногоФайла("PDF");
	табДокЧекка.Записать(имяФайлаВложения,ТипФайлаТабличногоДокумента.PDF);
	АдресВоВременномХранилище =ПоместитьВоВременноеХранилище(новый ДвоичныеДанные(имяФайлаВложения));;
	
	ТемаПисьма =Расходная.Участник.Наименование+ " Чек №"+ Расходная.Номер+" от "+Формат(Расходная.дата,"ДФ=dd.MM.yyyy");
	
	
	чек = Новый Структура;
	чек.Вставить("Представление", "Чек №"+ Расходная.Номер+" от "+Формат(Расходная.дата,"ДФ=dd.MM.yyyy")+"_" +Расходная.Участник+".PDF");
	чек.Вставить("АдресВоВременномХранилище", АдресВоВременномХранилище);
	
	Вложения = Новый Массив;
	Вложения.Добавить(чек);
	
	ПарамтерыОтправления = Новый Структура;
	ПарамтерыОтправления.Вставить("Кому", 		ПолучателиПисьма);
	ПарамтерыОтправления.Вставить("Получатель", ПолучателиПисьма);
	ПарамтерыОтправления.Вставить("Предмет", 	Расходная);
	ПарамтерыОтправления.Вставить("Тема", 		ТемаПисьма);
	ПарамтерыОтправления.Вставить("Тело", 		ТемаПисьма);
	ПарамтерыОтправления.Вставить("Вложения",	Вложения);
	
	Возврат ПарамтерыОтправления;
	
КонецФункции


Функция ОтправитьЧекТранзита(ВыдачаТранзита) Экспорт
	
	
	УчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	ПарамтерыОтправления = ПараметыЧекаТранзита(ВыдачаТранзита);
	
	РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись,ПарамтерыОтправления);
	
	
КонецФункции	


Функция ОтправитьЧекРасходной(Расходная) Экспорт
	Если Расходная.Ответственный.ОтправлятьЧекСотруднику и 
		ЗначениеЗаполнено(Расходная.Ответственный.ЕМайл) Тогда
		
		УчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
		ПарамтерыОтправления = ПараметыЧекаРасходной(Расходная);
		
		РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись,ПарамтерыОтправления);
	КонецЕсли;
	
КонецФункции
